sorosaulong-ux/gd32-test-project/Library/gd32a7xx_ioc.c
/*!
    \file    gd32a7xx_ioc.c
    \brief   IOC driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_ioc.h"

/*!
    \brief      enable IOC (API_ID: 0x0001U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ioc_enable(void)
{
    IOC_CTL &= ~(IOC_CTL_IOCEN);
}

/*!
    \brief      disable IOC (API_ID: 0x0002U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ioc_disable(void)
{
    IOC_CTL |= IOC_CTL_IOCEN;
}

/*!
    \brief      reset IOC (API_ID: 0x0003U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ioc_reset(void)
{
    IOC_RST0 |= IOC_RST0_RST0;
    IOC_RST1 |= IOC_RST1_RST1;
}

/*!
    \brief      get IOC enable flag (API_ID: 0x0004U)
    \param[in]  none
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus ioc_enable_flag_get(void)
{
    FlagStatus reval;
    if(0U == ((IOC_CTL & IOC_CTL_IOCENF))) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      get IOC reset flag (API_ID: 0x0005U)
    \param[in]  none
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus ioc_reset_flag_get(void)
{
    FlagStatus reval;
    if((uint32_t)RESET != (IOC_RST1 & (IOC_RST1_RSTF))) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear IOC reset flag (API_ID: 0x0006U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ioc_reset_flag_clear(void)
{
    IOC_RSTSTATC |= IOC_RSTSTATC_RSTFC;
}

/*!
    \brief      enable IOC clock (API_ID: 0x0007U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ioc_clock_enable(void)
{
    IOC_CTL &= ~(IOC_CTL_CLKEN);
}

/*!
    \brief      disable IOC clock (API_ID: 0x0008U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ioc_clock_disable(void)
{
    IOC_CTL |= IOC_CTL_CLKEN;
}

/*!
    \brief      configure IOC clock prescaler (API_ID: 0x0009U)
    \param[in]  psc: 0-0x000000FF, clock prescaler
    \param[out] none
    \retval     none
*/
void ioc_prescaler_config(uint8_t psc)
{
    IOC_CTL &= ~IOC_CTL_PSC;
    IOC_CTL |= ((uint32_t)psc << 8U);
}

/*!
    \brief      configure IOC FPM mode (API_ID: 0x000AU)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[in]  fpm_mode: FPM mode
                only one parameter can be selected which is shown as below:
      \arg        DLY_DEB_BOTH_EDGE: delayed debounce filter mode on both edges
      \arg        IMM_DEB_BOTH_EDGE: immediate debounce filter mode on both edges
      \arg        IMM_DEBE_R_EDGE: immediate debounce filter mode on rising edge, no filtering on falling edge
      \arg        IMM_DEBE_F_EDGE: no filtering on rising edge, immediate debounce filter mode on falling edge
      \arg        DLY_DEB_R_EDGE_IMM_DEB_F_EDGE: delayed debounce filter mode on rising edge, immediate debounce filter mode on falling edge
      \arg        IMM_DEB_R_EDGE_DLY_DEB_F_EDGE: immediate debounce filter mode on rising edge, delayed debounce filter mode on falling edge
      \arg        PRESCALER_R_EDGE: prescaler mode (triggered on rising edge)
      \arg        PRESCALER_F_EDGE: prescaler mode (triggered on falling edge)
    \param[out] none
    \retval     none
*/
void ioc_fpm_mode_config(ioc_fpmx_enum fpmx, uint32_t fpm_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FPM_MODE(fpm_mode)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_FPMCFG((uint32_t)fpmx) &= ~IOC_FPMX_CFG_MSEL;
        IOC_FPMCFG((uint32_t)fpmx) |= fpm_mode;
    }
}

/*!
    \brief      configure IOC FPM reference input signal selection (API_ID: 0x000BU)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[in]  input_signal: reference input signal
                only one parameter can be selected which is shown as below:
      \arg        FPM_SO_REF: select FPMx_SO
      \arg        IOC_REFERENCE: select IOC_reference[x]
      \arg        RSG_REFERENCE: select RSG_reference[x]
    \param[out] none
    \retval     none
*/
void ioc_fpm_reference_signal_select(ioc_fpmx_enum fpmx, uint32_t input_signal)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FPM_REF_INPUT_SIGNAL(input_signal)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_FPMCFG((uint32_t)fpmx) &= ~IOC_FPMX_CFG_RISEL;
        IOC_FPMCFG((uint32_t)fpmx) |= input_signal;
    }
}

/*!
    \brief      configure IOC FPM monitor input signal selection (API_ID: 0x000CU)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[in]  input_signal: monitor input signal
                only one parameter can be selected which is shown as below:
      \arg        FPM_SO_MON: select FPMx_SO
      \arg        IOC_MONITOR: select IOC_rmonitor[x]
    \param[out] none
    \retval     none
*/
void ioc_fpm_monitor_signal_select(ioc_fpmx_enum fpmx, uint32_t input_signal)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FPM_MON_INPUT_SIGNAL(input_signal)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_FPMCFG((uint32_t)fpmx) &= ~IOC_FPMX_CFG_MISEL;
        IOC_FPMCFG((uint32_t)fpmx) |= input_signal;
    }
}

/*!
    \brief      enable reset the counter of timer (API_ID: 0x000DU)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[out] none
    \retval     none
*/
void ioc_fpm_timer_reset_enable(ioc_fpmx_enum fpmx)
{
    IOC_FPMCFG((uint32_t)fpmx) |= IOC_FPMX_CFG_RCNT;
}

/*!
    \brief      disable reset the counter of timer, decrement the counter by one (API_ID: 0x000EU)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[out] none
    \retval     none
*/
void ioc_fpm_timer_reset_disable(ioc_fpmx_enum fpmx)
{
    IOC_FPMCFG((uint32_t)fpmx) &= ~IOC_FPMX_CFG_RCNT;
}

/*!
    \brief      configure the value of 16 bit comparator (API_ID: 0x000FU)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[in]  value: 0x0000-0xFFFF, the value of 16 bit comparator
    \param[out] none
    \retval     none
*/
void ioc_fpm_cmp_config(ioc_fpmx_enum fpmx, uint16_t value)
{
    IOC_FPMCFG((uint32_t)fpmx) &= ~IOC_FPMX_CFG_CMP;
    IOC_FPMCFG((uint32_t)fpmx) |= value;
}

/*!
    \brief      get the value of reference signal FPM timer counter (API_ID: 0x0010U)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[out] none
    \retval     none
*/
uint32_t ioc_rfpm_counter_get(ioc_fpmx_enum fpmx)
{
    uint32_t reval;
    reval = IOC_RFPMCNT((uint32_t)fpmx);
    return reval;
}

/*!
    \brief      get the value of monitor signal FPM timer counter (API_ID: 0x0011U)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[out] none
    \retval     none
*/
uint32_t ioc_mfpm_counter_get(ioc_fpmx_enum fpmx)
{
    uint32_t reval;
    reval = IOC_MFPMCNT((uint32_t)fpmx);
    return reval;
}

/*!
    \brief      get reference signal FPM edge status (API_ID: 0x0012U)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[in]  edge_flag: FPM edge status flag, refer to ioc_fpm_edge_stat_enum
                only one parameter can be selected which is shown as below:
      \arg        FPM_FLAG_FALLING_EDGE: FPM falling edge flag
      \arg        FPM_FLAG_RISING_EDGE: FPM rising edge flag
    \param[out] none
    \retval     none
*/
FlagStatus ioc_rfpm_glitch_flag_get(ioc_fpmx_enum fpmx, ioc_fpm_edge_stat_enum edge_flag)
{
    FlagStatus reval;
    uint32_t flagstatus;

    if(FPM_FLAG_FALLING_EDGE == edge_flag) {
        flagstatus = (uint32_t)(IOC_RFPMESTAT >> (uint32_t)fpmx);
    } else {
        flagstatus = (uint32_t)(IOC_RFPMESTAT >> ((uint32_t)fpmx + 16U));
    }

