sorosaulong-ux/gd32-test-project/Library/gd32a7xx_ioc.c
    if(0U != (flagstatus & 0x01U)) {
        reval = SET;
    } else {
        reval = RESET;
    }

    return reval;
}

/*!
    \brief      get monitor signal FPM edge status (API_ID: 0x0013U)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[in]  edge_flag: FPM edge status flag, refer to ioc_fpm_edge_stat_enum
                only one parameter can be selected which is shown as below:
      \arg        FPM_FLAG_FALLING_EDGE: FPM falling edge flag
      \arg        FPM_FLAG_RISING_EDGE: FPM rising edge flag
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus ioc_mfpm_glitch_flag_get(ioc_fpmx_enum fpmx, ioc_fpm_edge_stat_enum edge_flag)
{
    FlagStatus reval;
    uint32_t flagstatus;

    if(FPM_FLAG_FALLING_EDGE == edge_flag) {
        flagstatus = (uint32_t)(IOC_MFPMESTAT >> (uint32_t)fpmx);
    } else {
        flagstatus = (uint32_t)(IOC_MFPMESTAT >> ((uint32_t)fpmx + 16U));
    }

    if(0U != (flagstatus & 0x01U)) {
        reval = SET;
    } else {
        reval = RESET;
    }

    return reval;
}

/*!
    \brief      clear reference signal FPM edge status (API_ID: 0x0014U)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[in]  edge_flag: FPM edge status flag, refer to ioc_fpm_edge_stat_enum
                only one parameter can be selected which is shown as below:
      \arg        FPM_FLAG_FALLING_EDGE: FPM falling edge flag
      \arg        FPM_FLAG_RISING_EDGE: FPM rising edge flag
    \param[out] none
    \retval     none
*/
void ioc_rfpm_glitch_flag_clear(ioc_fpmx_enum fpmx, ioc_fpm_edge_stat_enum edge_flag)
{
    if(FPM_FLAG_FALLING_EDGE == edge_flag) {
        IOC_RFPMESTAT &= ~((uint32_t)1U << (uint32_t)fpmx);
    } else {
        IOC_RFPMESTAT &= ~((uint32_t)1U << ((uint32_t)fpmx + 16U));
    }
}

/*!
    \brief      clear reference signal FPM edge status(API_ID: 0x0015U)
    \param[in]  fpmx: FPMx, refer to ioc_fpmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FPM0
      \arg        IOC_FPM1
      \arg        IOC_FPM2
      \arg        IOC_FPM3
      \arg        IOC_FPM4
      \arg        IOC_FPM5
      \arg        IOC_FPM6
      \arg        IOC_FPM7
    \param[in]  edge_flag: FPM edge status flag, refer to ioc_fpm_edge_stat_enum
                only one parameter can be selected which is shown as below:
      \arg        FPM_FLAG_FALLING_EDGE: FPM falling edge flag
      \arg        FPM_FLAG_RISING_EDGE: FPM rising edge flag
    \param[out] none
    \retval     none
*/
void ioc_mfpm_glitch_flag_clear(ioc_fpmx_enum fpmx, ioc_fpm_edge_stat_enum edge_flag)
{
    if(FPM_FLAG_FALLING_EDGE == edge_flag) {
        IOC_MFPMESTAT &= ~((uint32_t)1U << (uint32_t)fpmx);
    } else {
        IOC_MFPMESTAT &= ~((uint32_t)1U << ((uint32_t)fpmx + 16U));
    }
}

/*!
    \brief      enable TRIGSEL input selection for RSG combiner (API_ID: 0x0016U)
    \param[in]  trigsel_input: TRIGSEL input
                only one parameter can be selected which is shown as below:
      \arg        RSG_TRIGSEL_INPUT0
      \arg        RSG_TRIGSEL_INPUT1
      \arg        RSG_TRIGSEL_INPUT2
      \arg        RSG_TRIGSEL_INPUT3
      \arg        RSG_TRIGSEL_INPUT4
      \arg        RSG_TRIGSEL_INPUT5
      \arg        RSG_TRIGSEL_INPUT6
      \arg        RSG_TRIGSEL_INPUT7
    \param[out] none
    \retval     none
*/
void ioc_rsg_input_enable(uint32_t trigsel_input)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RSG_TRIGSEL_INPUT(trigsel_input)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_RICTL |= trigsel_input;
    }
}

/*!
    \brief      disable TRIGSEL input selection for RSG combiner (API_ID: 0x0017U)
    \param[in]  trigsel_input: TRIGSEL input
                only one parameter can be selected which is shown as below:
      \arg        RSG_TRIGSEL_INPUT0
      \arg        RSG_TRIGSEL_INPUT1
      \arg        RSG_TRIGSEL_INPUT2
      \arg        RSG_TRIGSEL_INPUT3
      \arg        RSG_TRIGSEL_INPUT4
      \arg        RSG_TRIGSEL_INPUT5
      \arg        RSG_TRIGSEL_INPUT6
      \arg        RSG_TRIGSEL_INPUT7
    \param[out] none
    \retval     none
*/
void ioc_rsg_input_disable(uint32_t trigsel_input)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RSG_TRIGSEL_INPUT(trigsel_input)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_RICTL &= ~trigsel_input;
    }
}

/*!
    \brief      select reference signal (API_ID: 0x0018U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[in]  ref_signal: reference signal
                only one parameter can be selected which is shown as below:
      \arg        REFERENCE0
      \arg        REFERENCE1
      \arg        REFERENCE2
      \arg        REFERENCE3
      \arg        REFERENCE4
      \arg        REFERENCE5
      \arg        REFERENCE6
      \arg        REFERENCE7
    \param[out] none
    \retval     none
*/
void ioc_egm_reference_signal_select(ioc_egmx_enum egmx, uint32_t ref_signal)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_EGM_REFERENCE_SIGNAL(ref_signal)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_EGMCTL((uint32_t)egmx) &= ~IOC_EGMXCTL_REFSIGS;
        IOC_EGMCTL((uint32_t)egmx) |= ref_signal;
    }
}

/*!
    \brief      select monitor signal (API_ID: 0x0019U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[in]  mon_signal: monitor signal
                only one parameter can be selected which is shown as below:
      \arg        MONITOR0
      \arg        MONITOR1
      \arg        MONITOR2
      \arg        MONITOR3
      \arg        MONITOR4
      \arg        MONITOR5
      \arg        MONITOR6
      \arg        MONITOR7
    \param[out] none
    \retval     none
*/
void ioc_egm_monitor_signal_select(ioc_egmx_enum egmx, uint32_t mon_signal)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_EGM_MONITOR_SIGNAL(mon_signal)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_EGMCTL((uint32_t)egmx) &= ~IOC_EGMXCTL_MONSIGS;
        IOC_EGMCTL((uint32_t)egmx) |= mon_signal;
    }
}

/*!
    \brief      enable invert reference signal (API_ID: 0x001AU)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_reference_signal_invert_enable(ioc_egmx_enum egmx)
{
    IOC_EGMCTL((uint32_t)egmx) |= IOC_EGMXCTL_INVREN;
}

/*!
    \brief      disable invert reference signal (API_ID: 0x001BU)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_reference_signal_invert_disable(ioc_egmx_enum egmx)
{
    IOC_EGMCTL((uint32_t)egmx) &= ~IOC_EGMXCTL_INVREN;
}

/*!
    \brief      enable invert monitor signal (API_ID: 0x001CU)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_monitor_signal_invert_enable(ioc_egmx_enum egmx)
{
    IOC_EGMCTL((uint32_t)egmx) |= IOC_EGMXCTL_INVMEN;
}

/*!
    \brief      disable invert monitor signal (API_ID: 0x001DU)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_monitor_signal_invert_disable(ioc_egmx_enum egmx)
{
    IOC_EGMCTL((uint32_t)egmx) &= ~IOC_EGMXCTL_INVMEN;
}

/*!
    \brief      slect event window generation signal (API_ID: 0x001EU)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[in]  signal: event window generation signal
                only one parameter can be selected which is shown as below:
      \arg        EVENT_TRI_REFERENCE_SIGNAL: reference signal
      \arg        EVENT_TRI_MONITOR_SIGNAL: monitor signal
    \param[out] none
    \retval     none
*/
void ioc_egm_event_window_signal_select(ioc_egmx_enum egmx, uint32_t signal)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_EVENT_WIN_GENERATION_SIGNAL(signal)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_EGMCTL((uint32_t)egmx) &= ~IOC_EGMXCTL_EWGSIGS;
        IOC_EGMCTL((uint32_t)egmx) |= signal;
    }
}

/*!
    \brief      select event window triger edge (API_ID: 0x001FU)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[in]  triger_edge: event window triger edge
                only one parameter can be selected which is shown as below:
      \arg        NO_EDGE_CLR_GATE: neither edge used to clear event window counter. neither edge used to gate event generation.
      \arg        REDGE_CLR: rising edge used to clear event window counter. neither edge used to gate event generation.
      \arg        FEDGE_CLR: falling edge used to clear event window counter. neither edge used to gate event generation.
      \arg        BOTH_EDGE_CLR: both rising and falling edges used to clear event window counter. neither edge used to gate event generation.
      \arg        REDGE_GATE: neither edge used to clear event window counter. rising edge used to gate event generation.
      \arg        REDGE_CLR_REDGE_GATE: rising edge used to clear event window counter. rising edge used to gate event generation.
      \arg        FEDGE_CLR_REDGE_GATE: falling edge used to clear event window counter. rising edge used to gate event generation.
      \arg        BOTH_EDGE_CLR_REDGE_GATE: both rising and falling edges used to clear event window counter. rising edge used to gate event generation.
      \arg        FEDGE_GATE: neither edge used to clear event window counter. falling edge used to gate event generation.
      \arg        REDGE_CLR_FEDGE_GATE: rising edge used to clear event window counter. falling edge used to gate event generation.
      \arg        FEDGE_CLR_FEDGE_GATE:Falling edge used to clear event window counter. Falling edge used to gate event generation.
      \arg        BOTH_EDGE_CLR_FEDGE_GATE: both rising and falling edges used to clear event window counter. falling edge used to gate event generation.
      \arg        BOTH_EDGE_GATE: neither edge used to clear event window counter. both rising and falling edges used to gate event generation.
      \arg        REDGE_CLR_BOTH_EDGE_GATE: rising edge used to clear event window counter. both rising and falling edges used to gate event generation.
      \arg        FEDGE_CLR_BOTH_EDGE_GATE: falling edge used to clear event window counter. both rising and falling edges used to gate event generation.
      \arg        BOTH_EDGE_CLR_GATE: both rising and falling edges used to clear event window counter. both rising and falling edges used to gate event generation.
    \param[out] none
    \retval     none
*/
void ioc_egm_event_window_triger_edge_select(ioc_egmx_enum egmx, uint32_t triger_edge)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_EGM_EVENT_WIN_TRIGER(triger_edge)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_EGMCTL((uint32_t)egmx) &= ~IOC_EGMXCTL_EWAES;
        IOC_EGMCTL((uint32_t)egmx) |= triger_edge;
    }
}

/*!
    \brief      enable event window inverted (API_ID: 0x0020U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_event_window_invert_enable(ioc_egmx_enum egmx)
{
    IOC_EGMCTL((uint32_t)egmx) |= IOC_EGMXCTL_INVEWEN;
}

/*!
    \brief      disable event window inverted (API_ID: 0x0021U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_event_window_invert_disable(ioc_egmx_enum egmx)
{
    IOC_EGMCTL((uint32_t)egmx) &= ~IOC_EGMXCTL_INVEWEN;
}

/*!
    \brief      enable events generated (API_ID: 0x0022U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_event_generate_enable(ioc_egmx_enum egmx)
{
    IOC_EGMCTL((uint32_t)egmx) &= ~IOC_EGMXCTL_EVDIS;
}

/*!
    \brief      disable events generated (API_ID: 0x0023U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_event_generate_disable(ioc_egmx_enum egmx)
{
    IOC_EGMCTL((uint32_t)egmx) |= IOC_EGMXCTL_EVDIS;
}

/*!
    \brief      configure event window generation run mode (API_ID: 0x0024U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[in]  mode: run mode
                only one parameter can be selected which is shown as below:
      \arg        FREE_RUNNING_MODE: free running mode
      \arg        GATE_MODE: gate mode
    \param[out] none
    \retval     none
*/
void ioc_egm_event_generate_mode_config(ioc_egmx_enum egmx, uint32_t mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_EVENT_WIN_RUN_MODE(mode)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_EGMCTL((uint32_t)egmx) &= ~IOC_EGMXCTL_EWGRM;
        IOC_EGMCTL((uint32_t)egmx) |= mode;
    }
}

/*!
    \brief      enable monitor signal from the FPM compared with reference signal (API_ID: 0x0025U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_monitor_signal_compare_enable(ioc_egmx_enum egmx)
{
    IOC_EGMCTL((uint32_t)egmx) |= IOC_EGMXCTL_MREN;
}

/*!
    \brief      disable monitor signal from the FPM compared with reference signal, monitor signal is from monitor[x] (API_ID: 0x0026U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_monitor_signal_compare_disable(ioc_egmx_enum egmx)
{
    IOC_EGMCTL((uint32_t)egmx) &= ~IOC_EGMXCTL_MREN;
}

/*!
    \brief      configure event count threshold (API_ID: 0x0027U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[in]  threshold: event count threshold, 0x00000000-0x00FFFFFF
    \param[out] none
    \retval     none
*/
void ioc_egm_event_window_threshold_config(ioc_egmx_enum egmx, uint32_t threshold)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_EGM_EVENT_WIN_VALUE(threshold)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_EGMCFG((uint32_t)egmx) &= ~IOC_EGMXCFG_EWCTH;
        IOC_EGMCFG((uint32_t)egmx) |= threshold;
    }
}

/*!
    \brief      get the value of EGM event window counter (API_ID: 0x0028U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     the value of EGM event window counter, 0x00000000-0x00FFFFFF
*/
uint32_t ioc_egm_event_window_counter_get(ioc_egmx_enum egmx)
{
    uint32_t reval;
    reval = IOC_EGMCNT((uint32_t)egmx);
    return reval;
}

/*!
    \brief      get the overflow flag (API_ID: 0x0029U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus ioc_egm_counter_overflow_flag_get(ioc_egmx_enum egmx)
{
    FlagStatus reval;

    if(0U != ((IOC_EGMCNT((uint32_t)egmx) & (IOC_EGMXCNT_CNTOVF)) >> 31U)) {
        reval = SET;
    } else {
        reval = RESET;
    }

    return reval;
}

/*!
    \brief      clear the overflow flag (API_ID: 0x0030U)
    \param[in]  egmx: egmx, refer to ioc_egmx_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_EGM0
      \arg        IOC_EGM1
      \arg        IOC_EGM2
      \arg        IOC_EGM3
      \arg        IOC_EGM4
      \arg        IOC_EGM5
      \arg        IOC_EGM6
      \arg        IOC_EGM7
    \param[out] none
    \retval     none
*/
void ioc_egm_counter_overflow_flag_clear(ioc_egmx_enum egmx)
{
    IOC_EGMCNT((uint32_t)egmx) &= ~IOC_EGMXCNT_CNTOVF;
}

/*!
    \brief      select SEGM channel event(API_ID: 0x0031U)
    \param[in]  channel: SEGM channel, refer to ioc_segm_channel_enum
                only one parameter can be selected which is shown as below:
      \arg        SEGM_CHANNEL_0
      \arg        SEGM_CHANNEL_1
      \arg        SEGM_CHANNEL_2
      \arg        SEGM_CHANNEL_3
    \param[in]  event: SEGM channel event
                only one parameter can be selected which is shown as below:
      \arg        SEGM_EGM_EVENT0
      \arg        SEGM_EGM_EVENT1
      \arg        SEGM_EGM_EVENT2
      \arg        SEGM_EGM_EVENT3
      \arg        SEGM_EGM_EVENT4
      \arg        SEGM_EGM_EVENT5
      \arg        SEGM_EGM_EVENT6
      \arg        SEGM_EGM_EVENT7
    \param[out] none
    \retval     none
*/
void ioc_segm_input_seclect(ioc_segm_channel_enum channel, uint32_t event)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_SEGM_EVENT(event)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        case SEGM_CHANNEL_0:
            IOC_SEGMCTL0 &= ~IOC_SEGMCTL0_CH0ES;
            IOC_SEGMCTL0 |= event;
            break;
        case SEGM_CHANNEL_1:
            IOC_SEGMCTL0 &= ~IOC_SEGMCTL0_CH1ES;
            IOC_SEGMCTL0 |= (event << 8U);
            break;
        case SEGM_CHANNEL_2:
            IOC_SEGMCTL0 &= ~IOC_SEGMCTL0_CH2ES;
            IOC_SEGMCTL0 |= (event << 16U);
            break;
        case SEGM_CHANNEL_3:
            IOC_SEGMCTL0 &= ~IOC_SEGMCTL0_CH3ES;
            IOC_SEGMCTL0 |= (event << 24U);
            break;
        default:
            break;
        }
    }
}

