sorosaulong-ux/gd32-test-project/Library/gd32a7xx_ioc.c
/*!
    \brief      configure SEGM channel event counter threshold (API_ID: 0x0032U)
    \param[in]  channel: SEGM channel, refer to ioc_segm_channel_enum
                only one parameter can be selected which is shown as below:
      \arg        SEGM_CHANNEL_0
      \arg        SEGM_CHANNEL_1
      \arg        SEGM_CHANNEL_2
      \arg        SEGM_CHANNEL_3
    \param[in]  threshold: 0x00000000-0x0000000F
    \param[out] none
    \retval     none
*/
void ioc_segm_counter_threshold_config(ioc_segm_channel_enum channel, uint32_t threshold)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_SEGM_EVENT_COUNTER_VALUE(threshold)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        case SEGM_CHANNEL_0:
            IOC_SEGMCTL0 &= ~IOC_SEGMCTL0_CH0THR;
            IOC_SEGMCTL0 |= (threshold << 4U);
            break;
        case SEGM_CHANNEL_1:
            IOC_SEGMCTL0 &= ~IOC_SEGMCTL0_CH1THR;
            IOC_SEGMCTL0 |= (threshold << 12U);
            break;
        case SEGM_CHANNEL_2:
            IOC_SEGMCTL0 &= ~IOC_SEGMCTL0_CH2THR;
            IOC_SEGMCTL0 |= (threshold << 20U);
            break;
        case SEGM_CHANNEL_3:
            IOC_SEGMCTL0 &= ~IOC_SEGMCTL0_CH3THR;
            IOC_SEGMCTL0 |= (threshold << 28U);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      enable EGM_EVENTx selection(API_ID: 0x0033U)
    \param[in]  egm_event: enable EGM_EVENTx selection
                only one parameter can be selected which is shown as below:
      \arg        SEGM_EGM_EVENT0_ENABLE
      \arg        SEGM_EGM_EVENT1_ENABLE
      \arg        SEGM_EGM_EVENT2_ENABLE
      \arg        SEGM_EGM_EVENT3_ENABLE
      \arg        SEGM_EGM_EVENT4_ENABLE
      \arg        SEGM_EGM_EVENT5_ENABLE
      \arg        SEGM_EGM_EVENT6_ENABLE
      \arg        SEGM_EGM_EVENT7_ENABLE
    \param[out] none
    \retval     none
*/
void ioc_segm_egm_event_enable(uint32_t egm_event)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_SEGM_EGM_EVENT_ENABLE(egm_event)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0033U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {

        IOC_SEGMCTL1 |= egm_event;

    }
}

/*!
    \brief      disable EGM_ETMx selection(API_ID: 0x0034U)
    \param[in]  egm_event: disable EGM_EVENTx selection
                only one parameter can be selected which is shown as below:
      \arg        SEGM_EGM_EVENT0_DISABLE
      \arg        SEGM_EGM_EVENT1_DISABLE
      \arg        SEGM_EGM_EVENT2_DISABLE
      \arg        SEGM_EGM_EVENT3_DISABLE
      \arg        SEGM_EGM_EVENT4_DISABLE
      \arg        SEGM_EGM_EVENT5_DISABLE
      \arg        SEGM_EGM_EVENT6_DISABLE
      \arg        SEGM_EGM_EVENT7_DISABLE
    \param[out] none
    \retval     none
*/
void ioc_segm_egm_event_disable(uint32_t egm_event)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_SEGM_EGM_EVENT_DISABLE(egm_event)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0034U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        IOC_SEGMCTL1 &= egm_event;
    }
}

/*!
    \brief      enable SEGM channel selection(API_ID: 0x0035U)
    \param[in]  channel: SEGM channel, refer to ioc_segm_channel_enum
                only one parameter can be selected which is shown as below:
      \arg        SEGM_CHANNEL_0
      \arg        SEGM_CHANNEL_1
      \arg        SEGM_CHANNEL_2
      \arg        SEGM_CHANNEL_3
    \param[out] none
    \retval     none
*/
void ioc_segm_channel_enable(ioc_segm_channel_enum channel)
{
    switch(channel) {
    case SEGM_CHANNEL_0:
        IOC_SEGMCTL1 |= IOC_SEGMCTL1_SEGM_CH0EN;
        break;
    case SEGM_CHANNEL_1:
        IOC_SEGMCTL1 |= IOC_SEGMCTL1_SEGM_CH1EN;
        break;
    case SEGM_CHANNEL_2:
        IOC_SEGMCTL1 |= IOC_SEGMCTL1_SEGM_CH2EN;
        break;
    case SEGM_CHANNEL_3:
        IOC_SEGMCTL1 |= IOC_SEGMCTL1_SEGM_CH3EN;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable SEGM channel selection(API_ID: 0x0036U)
    \param[in]  channel: SEGM channel, refer to ioc_segm_channel_enum
                only one parameter can be selected which is shown as below:
      \arg        SEGM_CHANNEL_0
      \arg        SEGM_CHANNEL_1
      \arg        SEGM_CHANNEL_2
      \arg        SEGM_CHANNEL_3
    \param[out] none
    \retval     none
*/
void ioc_segm_channel_disable(ioc_segm_channel_enum channel)
{
    switch(channel) {
    case SEGM_CHANNEL_0:
        IOC_SEGMCTL1 &= ~IOC_SEGMCTL1_SEGM_CH0EN;
        break;
    case SEGM_CHANNEL_1:
        IOC_SEGMCTL1 &= ~IOC_SEGMCTL1_SEGM_CH1EN;
        break;
    case SEGM_CHANNEL_2:
        IOC_SEGMCTL1 &= ~IOC_SEGMCTL1_SEGM_CH2EN;
        break;
    case SEGM_CHANNEL_3:
        IOC_SEGMCTL1 &= ~IOC_SEGMCTL1_SEGM_CH3EN;
        break;
    default:
        break;
    }
}

/*!
    \brief      get SEGM system event recore flag(API_ID: 0x0037U)
    \param[in]  flag: EGMx (x = 0...7) triggered system event flag, refer to ioc_segm_generate_event_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        EGM0_TRIG_SYSTEM_EVENT_FLAG0
      \arg        EGM1_TRIG_SYSTEM_EVENT_FLAG0
      \arg        EGM2_TRIG_SYSTEM_EVENT_FLAG0
      \arg        EGM3_TRIG_SYSTEM_EVENT_FLAG0
      \arg        EGM4_TRIG_SYSTEM_EVENT_FLAG0
      \arg        EGM5_TRIG_SYSTEM_EVENT_FLAG0
      \arg        EGM6_TRIG_SYSTEM_EVENT_FLAG0
      \arg        EGM7_TRIG_SYSTEM_EVENT_FLAG0
      \arg        EGM0_TRIG_SYSTEM_EVENT_FLAG1
      \arg        EGM1_TRIG_SYSTEM_EVENT_FLAG1
      \arg        EGM2_TRIG_SYSTEM_EVENT_FLAG1
      \arg        EGM3_TRIG_SYSTEM_EVENT_FLAG1
      \arg        EGM4_TRIG_SYSTEM_EVENT_FLAG1
      \arg        EGM5_TRIG_SYSTEM_EVENT_FLAG1
      \arg        EGM6_TRIG_SYSTEM_EVENT_FLAG1
      \arg        EGM7_TRIG_SYSTEM_EVENT_FLAG1
      \arg        EGM0_TRIG_SYSTEM_EVENT_FLAG2
      \arg        EGM1_TRIG_SYSTEM_EVENT_FLAG2
      \arg        EGM2_TRIG_SYSTEM_EVENT_FLAG2
      \arg        EGM3_TRIG_SYSTEM_EVENT_FLAG2
      \arg        EGM4_TRIG_SYSTEM_EVENT_FLAG2
      \arg        EGM5_TRIG_SYSTEM_EVENT_FLAG2
      \arg        EGM6_TRIG_SYSTEM_EVENT_FLAG2
      \arg        EGM7_TRIG_SYSTEM_EVENT_FLAG2
      \arg        EGM0_TRIG_SYSTEM_EVENT_FLAG3
      \arg        EGM1_TRIG_SYSTEM_EVENT_FLAG3
      \arg        EGM2_TRIG_SYSTEM_EVENT_FLAG3
      \arg        EGM3_TRIG_SYSTEM_EVENT_FLAG3
      \arg        EGM4_TRIG_SYSTEM_EVENT_FLAG3
      \arg        EGM5_TRIG_SYSTEM_EVENT_FLAG3
      \arg        EGM6_TRIG_SYSTEM_EVENT_FLAG3
      \arg        EGM7_TRIG_SYSTEM_EVENT_FLAG3
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus ioc_segm_history_trigge_flag_get(ioc_segm_generate_event_flag_enum flag)
{
    FlagStatus reval;

    if(0U != (IOC_REG_VAL(flag) & BIT(IOC_BIT_POS(flag)))) {
        reval = SET;
    } else {
        reval = RESET;
    }

    return reval;
}

/*!
    \brief      enable IOC TMR interrupt(API_ID: 0x0038U)
    \param[in]  tmr_interrupt: TMR interrupt, refer to ioc_tmr_interrupt_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_INT_TMRERR_PSC
      \arg        IOC_INT_TMRERR_CLKEN
      \arg        IOC_INT_TMRERR_MCEN
    \param[out] none
    \retval     none
*/
void ioc_tmr_interrupt_enable(ioc_tmr_interrupt_enum tmr_interrupt)
{
    IOC_REG_VAL(tmr_interrupt) |= BIT(IOC_BIT_POS(tmr_interrupt));
}

/*!
    \brief      disable IOC TMR interrupt(API_ID: 0x0039U)
    \param[in]  tmr_interrupt: TMR interrupt, refer to ioc_tmr_interrupt_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_INT_TMRERR_PSC
      \arg        IOC_INT_TMRERR_CLKEN
      \arg        IOC_INT_TMRERR_MCEN
    \param[out] none
    \retval     none
*/
void ioc_tmr_interrupt_disable(ioc_tmr_interrupt_enum tmr_interrupt)
{

    IOC_REG_VAL(tmr_interrupt) &= ~BIT(IOC_BIT_POS(tmr_interrupt));
}

/*!
    \brief      get IOC TMR flag(API_ID: 0x003AU)
    \param[in]  tmr_flag: TMR flag, refer to ioc_tmr_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FLAG_TMRERR_PSC
      \arg        IOC_FLAG_TMRERR_CLKEN
      \arg        IOC_FLAG_TMRERR_MCEN
    \param[out] none
    \retval     none
*/
FlagStatus ioc_tmr_flag_get(ioc_tmr_flag_enum tmr_flag)
{
    FlagStatus reval;

    if(0U != (IOC_REG_VAL(tmr_flag) & BIT(IOC_BIT_POS(tmr_flag)))) {
        reval = SET;
    } else {
        reval = RESET;
    }

    return reval;
}

/*!
    \brief      clear IOC TMR flag(API_ID: 0x003BU)
    \param[in]  tmr_flag: TMR flag, refer to ioc_tmr_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_FLAG_TMRERR_PSC
      \arg        IOC_FLAG_TMRERR_CLKEN
      \arg        IOC_FLAG_TMRERR_MCEN
    \param[out] none
    \retval     none
*/
void ioc_tmr_flag_clear(ioc_tmr_flag_enum tmr_flag)
{
    IOC_REG_VAL(tmr_flag) |= BIT(IOC_BIT_POS(tmr_flag));
}

/*!
    \brief      get IOC TMR interrupt and flag status(API_ID: 0x003CU)
    \param[in]  tmr_int_flag: TMR flag, refer to ioc_tmr_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        IOC_INT_FLAG_TMRERR_PSC
      \arg        IOC_INT_FLAG_TMRERR_CLKEN
      \arg        IOC_INT_FLAG_TMRERR_MCEN
    \param[out] none
    \retval     none
*/
FlagStatus ioc_tmr_interrupt_flag_get(ioc_tmr_interrupt_flag_enum tmr_int_flag)
{
    FlagStatus reval;
    uint32_t intenable, flagStatus;

    /* get the interrupt enable bit status */
    intenable = (IOC_REG_VAL(tmr_int_flag) & BIT(IOC_BIT_POS(tmr_int_flag)));
    /* get the corresponding flag bit status */
    flagStatus = (IOC_REG_VAL2(tmr_int_flag) & BIT(IOC_BIT_POS2(tmr_int_flag)));

    if((0U != flagStatus) && (0U != intenable)) {
        reval = SET;
    } else {
        reval = RESET;
    }

    return reval;
}

/*!
    \brief      enable alarm interrupt(API_ID: 0x003DU)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ioc_alarm_interrupt_enable(void)
{
    IOC_INTSTAT |= IOC_INTSTAT_ALRMIE;
}

/*!
    \brief      disable alarm interrupt(API_ID: 0x003EU)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ioc_alarm_interrupt_disable(void)
{
    IOC_INTSTAT &= ~IOC_INTSTAT_ALRMIE;
}

/*!
    \brief      get SEGM event trigger flag(API_ID: 0x003FU)
    \param[in]  none
    \param[out] none
    \retval     none
*/
FlagStatus ioc_segm_systerm_event_trigge_flag_get(void)
{
    FlagStatus reval;
    if(0U != (IOC_INTSTAT & IOC_INTSTAT_ALRMIF)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear SEGM event trigger flag(API_ID: 0x0040U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ioc_segm_systerm_event_trigge_flag_clear(void)
{
    IOC_INTSTAT |= IOC_INTSTAT_ALRMIF;
}
